*** False-sign and False-scan a document
- Get the PDF the bureaucrats want you to print, sign and scan (e.g. =document.pdf=),
- run =./falsisign.sh -d document.pdf -s signatures -x 1000 -y 2500 -o document-scanned.pdf=:
  - The first argument is the document you need to sign/scan
  - The second argument is the directory with all your different signatures
  - The next two arguments are the X and Y coordinates of where your signature will be. The page dimension is 3560x4752.
  - The last argument is the output file name.


You can also initial and sign a document, and choose the pages where to sign and initial (don't forget to quote the page numbers!). The full usage string is:
#+BEGIN_SRC bash :results raw :exports results
  ./falsisign.sh -h
#+END_SRC

#+RESULTS:
Falsisign.

Usage:
    falsisign -d <input_pdf> -x <X> -y <Y> [-p <pages>] -s <sign_dir> [-S <scale>] [-c] [-i <init_dir> -z <Z> -t <T> [-q <pages>]] [-r <density>] -o <output_pdf>

Options:
    -d <input_pdf>   The PDF document you want to sign
    -x <X>           The horizontal position in pixels of where the signature will be
    -y <Y>           The vertical position in pixels of where the signature will be
    -p <pages>       Optional space-separated list of pages to sign, e.g. '2 4 10'
                     Defaults to all or only the last if -i is specified
    -s <sign_dir>    Directory where the signatures will be randomly chosen
    -S <scale>       Scaling of the randomly chosen signature in percentage
    -c               Make a clean scan (disable noise and rotation)
    -i <init_dir>    Optional directory where the initials will be randomly chosen
    -z <Z>           Optional horizontal position in pixels of the initials
    -t <T>           Optional vertical position in pixels of the initials
    -q <pages>       Optional space-separated list of pages to initial
                     Defaults to all but the last
    -r <density>     Specify the dpi to use in intermediate steps
    -a <angle>  Specify the rotation (in degrees) to use for all pages
    -o <output_pdf>  The output file name
